app/views/contacts/index.html.erb

SELECT "contacts".* FROM "contacts"
---
          <label for='first-name'>First Name</label>
          <input type='text' id='first-name' class='input' name='contact[first_name]' value='<%= @contact.first_name %>'>