app/controllers/contacts_controller.rb

  def index
    @contact = Contact.new(flash[:contact_params]) || Contact.new
    @contacts = Contact.all
---
SELECT "contacts".* FROM "contacts"

  def create
    @contacts = Contact.all
    @contact = Contact.new(contact_params)
    if @contact.save
      @contact = Contact.new
      Event.increment(:add_contact)
---
SELECT "contacts".* FROM "contacts"
INSERT INTO "contacts" ("created_at", "first_name", "image", "last_name", "phone_number", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", "2015-01-16 01:45:23.649176"], ["first_name", "danny"], ["image", "dafgadsf"], ["last_name", "burt"], ["phone_number", "13453245"], ["updated_at", "2015-01-16 01:45:23.649176"]]
UPDATE "events" SET "times" = ?, "updated_at" = ? WHERE "events"."id" = 2  [["times", 1], ["updated_at", "2015-01-16 08:49:38.198082"]]

  def import
    JSON.parse(params[:contacts][:json]).each do |person|
      @contact = Contact.where(person).first_or_create!
    end
    Event.increment(:import_contacts)
---
INSERT INTO "contacts" ("created_at", "first_name", "image", "last_name", "phone_number", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
UPDATE "events" SET "times" = ?, "updated_at" = ? WHERE "events"."id" = 3  [["times", 1], ["updated_at", "2015-01-16 08:49:12.907283"]]

  def destroy
    @contact = Contact.find(params[:id])
    @contact.destroy
    Event.increment(:delete_contact)
---
SELECT  "contacts".* FROM "contacts"  WHERE "contacts"."id" = ? LIMIT 1  [["id", 6]]
DELETE FROM "contacts" WHERE "contacts"."id" = ?  [["id", 6]]
UPDATE "events" SET "times" = ?, "updated_at" = ? WHERE "events"."id" = 4  [["times", 1], ["updated_at", "2015-01-16 08:49:47.184875"]]